# .concat
# .merge

In [2]:
import pandas as pd
import numpy as np

# . concat()

In [3]:
AB={
    "A":("A0","A1","A2","A3"),
    "B":("B0","B1","B2","B3")
}

In [4]:
CD={
    "C":("C0","C1","C2","C3"),
    "D":("D0","D1","D2","D3")
}

In [5]:
AB

{'A': ('A0', 'A1', 'A2', 'A3'), 'B': ('B0', 'B1', 'B2', 'B3')}

In [6]:
df_AB=pd.DataFrame(AB)
df_CD=pd.DataFrame(CD)

In [7]:
df_AB

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [8]:
df_CD

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [9]:
pd.concat([df_AB,df_CD])

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [10]:
pd.concat([df_AB,df_CD],axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [11]:
pd.concat([df_AB,df_CD],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [12]:
df_AB.columns

Index(['A', 'B'], dtype='object')

In [13]:
df_AB.columns=df_CD.columns

In [14]:
df_AB.columns

Index(['C', 'D'], dtype='object')

In [15]:
pd.concat([df_AB,df_CD])

    C   D
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [16]:
kayit=pd.DataFrame({
    "kayit_id:":[1,2,3,4],
    "isim":["Demirel","Ecevit","Erbakan","Özal"]
})

In [17]:
giris=pd.DataFrame({
    "giris_id":[1,2,3,4],
    "isim":["Çiller","Demirel","Ecevit","Yılmaz"]
})

In [18]:
kayit

   kayit_id:     isim
0          1  Demirel
1          2   Ecevit
2          3  Erbakan
3          4     Özal

In [19]:
giris

   giris_id     isim
0         1   Çiller
1         2  Demirel
2         3   Ecevit
3         4   Yılmaz

In [20]:
pd.merge(kayit,giris)

   kayit_id:     isim  giris_id
0          1  Demirel         2
1          2   Ecevit         3

In [21]:
pd.merge(kayit,giris,how="right")

   kayit_id:     isim  giris_id
0        NaN   Çiller         1
1        1.0  Demirel         2
2        2.0   Ecevit         3
3        NaN   Yılmaz         4

In [22]:
pd.merge(kayit,giris,how="left") #kaydın içine giriş birleştirir.

   kayit_id:     isim  giris_id
0          1  Demirel       2.0
1          2   Ecevit       3.0
2          3  Erbakan       NaN
3          4     Özal       NaN

In [23]:
pd.merge(kayit,giris,how="outer") #bütün veriler

   kayit_id:     isim  giris_id
0        1.0  Demirel       2.0
1        2.0   Ecevit       3.0
2        3.0  Erbakan       NaN
3        NaN   Yılmaz       4.0
4        NaN   Çiller       1.0
5        4.0     Özal       NaN

In [24]:
giris=giris.set_index("isim")

In [25]:
giris

         giris_id
isim
Çiller          1
Demirel         2
Ecevit          3
Yılmaz          4

In [27]:
pd.merge(giris,kayit,left_index=True,right_on="isim")

   giris_id  kayit_id:     isim
0         2          1  Demirel
1         3          2   Ecevit

In [28]:
giris.reset_index()

      isim  giris_id
0   Çiller         1
1  Demirel         2
2   Ecevit         3
3   Yılmaz         4

In [29]:
kayit

   kayit_id:     isim
0          1  Demirel
1          2   Ecevit
2          3  Erbakan
3          4     Özal

In [32]:
kayit.columns=["kayit_id","kayit_ismi"]

In [33]:
kayit

   kayit_id kayit_ismi
0         1    Demirel
1         2     Ecevit
2         3    Erbakan
3         4       Özal

In [34]:
pd.merge(kayit,giris,left_on="kayit_ismi",right_on="isim")

   kayit_id kayit_ismi  giris_id
0         1    Demirel         2
1         2     Ecevit         3

In [35]:
kayit.columns=["id","isim"]
giris.reset_index(inplace=True)
giris.columns=["isim","id"]

In [36]:
kayit

   id     isim
0   1  Demirel
1   2   Ecevit
2   3  Erbakan
3   4     Özal

In [37]:
giris

      isim  id
0   Çiller   1
1  Demirel   2
2   Ecevit   3
3   Yılmaz   4

In [38]:
pd.merge(giris,kayit,on="isim")

      isim  id_x  id_y
0  Demirel     2     1
1   Ecevit     3     2

In [40]:
pd.merge(kayit,giris,on="isim",suffixes=("_kayit","_giris"))

   id_kayit     isim  id_giris
0         1  Demirel         2
1         2   Ecevit         3